{
    "chapters": [
        {
            "summary": "We're going to discuss renting versus buying. Listen to the entire thing before you judge and then comment on YouTube. 70% of people who watch our videos are not subscribed to our channel. Let us know what you think in the comments of YouTube if you agree or disagree.",
            "gist": "Renting vs Buying",
            "headline": "Sean: We're going to discuss renting versus buying on this podcast",
            "start": 90,
            "end": 101082
        },
        {
            "summary": "Rami: Even if we could afford to buy a home, we actually prefer to rent. He says sometimes it's financially beneficial to buy and other times it's beneficial to rented. Rami tells you about HubSpot for startups to help you grow your business without growing the stress.",
            "gist": "Buying vs Renting: Should You Buy or Rent?",
            "headline": "Rami discusses his opinion on buying versus renting in today's podcast",
            "start": 101136,
            "end": 269646
        },
        {
            "summary": "In many cases, buying a home is not more profitable than renting. More often than not, it's not as profitable or it's less profitable to buy than this to rent. The older I get, the more I appreciate what role luck played in my success.",
            "gist": "Trump: Sometimes It's More Profitable to Buy a Home than",
            "headline": "In many cases, buying a home is not more profitable than renting",
            "start": 269758,
            "end": 570862
        },
        {
            "summary": "Bob Greene: I'm moving to a place where I intend to rent. He wanted to rent a completely furnished home. He says he doesn't want to own a lot of stuff because he has to fix stuff all the time. Greene: My goal is to never set foot in a Home Depot ever again.",
            "gist": "When You Don't Want to Own a Home",
            "headline": "When people buy a house, they rarely want to rent afterwards",
            "start": 570926,
            "end": 693098
        },
        {
            "summary": "When he was renting in San Francisco, it was a steal. In New York, it would have cost 2.2 times more to own than to rent. Factor in taxes, maintenance, opportunity cost of the down payment, transaction costs. Do you have a time frame for when you might buy?",
            "gist": "Buying vs. Renting: The Math",
            "headline": "So when you're thinking of the buying versus renting thing, what percentage of your equation is on math",
            "start": 693184,
            "end": 959786
        },
        {
            "summary": "When buying a home, do you think it's going to be like, I would like to not lose money on this, or if possible, I want this to be a store of value. Like, give me an example. When my wife and I got married, I'd been saving for over a decade. I don't want cost to be relevant at all.",
            "gist": "Money is #4 on the list of financial decisions",
            "headline": "So is your mentality going into buying a home going to be different than previous purchases",
            "start": 959978,
            "end": 1027990
        },
        {
            "summary": "I've got a new project called Moneywise. It's a personal finance podcast for high net worth people or young people who are on their way to becoming high networth. The first episode is with a friend of mine. He gets super transparent about his monthly expenses, his portfolio, how it impacts his happiness.",
            "gist": "New Podcast: Moneywise",
            "headline": "I've got a new personal finance podcast called Moneywise",
            "start": 1033210,
            "end": 1081330
        },
        {
            "summary": "Business made simple is hosted by Donald Miller, and it's brought to you by the HubSpot podcast network. In this episode, Donald Miller looks at the whole hiring process. You'll learn why being self aware as a leader will help you avoid hiring disasters.",
            "gist": "The Hiring Process: How to Get the Perfect Employee",
            "headline": "This podcast is hosted by Donald Miller and is brought to you by HubSpot",
            "start": 1081410,
            "end": 1152294
        },
        {
            "summary": "I have ten money rules. One of the rules is be able to pay in cash for any large purchases. Will you get a mortgage, or does that depend on the rates? Maybe.",
            "gist": "Want to Buy a House in Cash?",
            "headline": "Rameet says he has ten money rules for when buying large purchases",
            "start": 1152422,
            "end": 1241350
        },
        {
            "summary": "When we go to buy a house, the general suggestion I give to people is you better plan to live there for at least ten years. In the case of buying a house and then moving in a few years, it's usually a big financial mistake. Family definitely factors in for sure.",
            "gist": "When Should You Buy A Home or Rent?",
            "headline": "When you buy a house, does family factor into your decision",
            "start": 1241510,
            "end": 1441562
        },
        {
            "summary": "The hardest part about deciding when to buy is deciding what I want. When you're thinking about buying a place, what attributes do you want it to have? I have a very specific and growing list. It's not about price, it's about getting exactly what you want.",
            "gist": "Adam Levine On Deciding When To Buy A Home",
            "headline": "When you're thinking about buying a house, what attributes do you want",
            "start": 1441616,
            "end": 1703926
        },
        {
            "summary": "Don't get too big of a house. Find it quite cavernous and so human sized. My vision is multiple pavilions. I don't like a house that's huge. I think I actually want like 5500.",
            "gist": "Should You Buy A Big House?",
            "headline": "Neville is trying to decide on the size of his next home",
            "start": 1703958,
            "end": 1898898
        },
        {
            "summary": "Ramit Saiti: Walkability is number one on his list of values. He rented a home across the street from a weekly farmers market. He says as an entrepreneur, it's important to have a simple list ofvalues.",
            "gist": "A List of Values For Real Estate",
            "headline": "Creating a simple list of values can help you decide on your next home",
            "start": 1898994,
            "end": 2004746
        },
        {
            "summary": "I'm actually methodical about acquiring just things on a daily basis. I like to buy something that I think can last for a long time. I think recycling is nonsense. I prefer to reduce and reuse. I love how you are intentional about what you buy.",
            "gist": "George Clooney On Buying Stuff For Life",
            "headline": "You say you're methodical about buying things on a daily basis",
            "start": 2004848,
            "end": 2258206
        },
        {
            "summary": "What you see in someone's house actually tells you a lot about who they are, their identity. As you have made more money, you also realize that when you go into their houses, there's a lot less stuff in there. It is really fascinating and extremely taboo to talk about.",
            "gist": "The Cost of Overspending",
            "headline": "Natalie: Often on my podcast, I speak to couples about money",
            "start": 2258308,
            "end": 2537014
        },
        {
            "summary": "Free repairs. What they don't love as much is spending on quality in the first place. I do a quarterly closet cleanse. It's just nice to get things out and it frees up mental space. That's the one thing I really need to improve on as it relates to cleanliness.",
            "gist": "Having A Hoarder's Mind",
            "headline": "I like your mentality of being selective about what you buy",
            "start": 2537052,
            "end": 2661118
        },
        {
            "summary": "Don't kid yourself and say that it's a good investment. Math is one part of it. But also there are other things. Family, just pure desire, anything you want, but you got to calculate it all. You need to be sure you're using your money to live your rich life.",
            "gist": "Run the Math Before Making a Spending Decision",
            "headline": "Ramit says you need to run the math before making big purchases",
            "start": 2661204,
            "end": 2738922
        },
        {
            "summary": "It is currently more expensive to buy than to rent in almost every city in America. Here's a simple request for anyone leaving a comment. If you agree or disagree with us, I'm very curious. Be nice about it.",
            "gist": "Does It Make Financial Sense to Buy a House?",
            "headline": "It is currently more expensive to buy than to rent in almost every American city",
            "start": 2738976,
            "end": 2943140
        }
    ],
    "audio_url": "https://www.listennotes.com/e/p/aa893d1970fb47ceb1d728dfdb2c6585/",
    "thumbnail": "https://production.listennotes.com/podcasts/my-first-million-sam-parr-shaan-puri-the-IDuKCrPtwTb-Vmz8LP7xJOS.300x300.jpg",
    "podcast_title": "My First Million",
    "episode_title": "Why You Should Rent Even If You’re A Millionaire"
}